// Создано tools/make_bedrock_tables.py — не править руками.

/// Сколько состояний блоков у Bedrock 1.26.10.
pub const BLOCK_STATES: usize = 15846;

/// Номер биома Bedrock для каждого нашего: по порядку `Biome::ALL`, затем
/// свои (`CUSTOM_BIOMES`), затем Незер (`Biome::NETHER`), Энд (`Biome::END`) и биомы 26.3 (`Biome::PREVIEW`).
pub const BIOMES: [u32; 65] = [0, 24, 44, 45, 46, 47, 42, 43, 40, 14, 16, 26, 25, 7, 11, 6, 191, 1, 129, 12, 140, 4, 132, 27, 155, 29, 5, 30, 32, 160, 21, 23, 48, 35, 2, 186, 192, 36, 185, 184, 182, 183, 189, 3, 131, 34, 163, 37, 165, 38, 193, 187, 188, 190, 4, 8, 179, 180, 178, 181, 9, 9, 9, 9, 9];

/// Биомы профиля Preview26_3 (`Biome::PREVIEW`) идут после `BIOMES`: пятнистый лес и серные пещеры.
pub const PREVIEW_BIOMES: [u32; 2] = [195, 194];
